In [1]:
import pandas as pd
import sqlite3

In [2]:
con = sqlite3.connect('db')

In [7]:
url = 'https://docs.google.com/spreadsheets/d/1JGPelh8YJCZgXhyq2aFiwnEmC03s0vHpnD-2xvopp8U/edit?usp=sharing'

In [8]:
id = url.split('/')[5]

In [9]:
id

'1JGPelh8YJCZgXhyq2aFiwnEmC03s0vHpnD-2xvopp8U'

In [10]:
df = pd.read_csv(f'https://docs.google.com/spreadsheets/d/{id}/export?format=csv')

In [20]:
sql = '''select * from list_users t'''

In [21]:
df.to_sql('list_users', con, index=False, if_exists='replace')

8

In [23]:
pd.read_sql(sql, con)

   Unnamed: 0   name    surname  age
0           0    Ali     Sultan   22
1           1  Enver       Kaya   33
2           2   Olya  Sniyakova   26
3           3   Olya  Sniyakova   26
4           4   Olya  Sniyakova   26
5           5   Olya  Sniyakova   26
6           6   Olya  Sniyakova   26
7           7   Olya  Sniyakova   26

In [25]:
def select(sql):
    return pd.read_sql(sql, con)

In [26]:
select(sql)

   Unnamed: 0   name    surname  age
0           0    Ali     Sultan   22
1           1  Enver       Kaya   33
2           2   Olya  Sniyakova   26
3           3   Olya  Sniyakova   26
4           4   Olya  Sniyakova   26
5           5   Olya  Sniyakova   26
6           6   Olya  Sniyakova   26
7           7   Olya  Sniyakova   26

In [ ]:
# users_name - sneake case